tap "databricks/tap"
tap "flyteorg/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "mongodb/brew"
tap "pantsbuild/tap"
brew "act"
brew "actionlint"
brew "antigen"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "asdf"
brew "xz"
brew "python@3.11"
brew "awscli"
brew "python@3.12"
brew "cairo"
brew "pycparser"
brew "cmake"
brew "gnutls"
brew "qemu"
brew "lima"
brew "colima"
brew "conan@1"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "docutils"
brew "dos2unix"
brew "git-lfs"
brew "glpk"
brew "go"
brew "grpcurl"
brew "hadolint"
brew "harfbuzz"
brew "helmfile"
brew "highs"
brew "htop"
brew "jenv"
brew "jq"
brew "kubernetes-cli"
brew "libomp"
brew "lynx"
brew "node"
brew "mongosh"
brew "mysql-client"
brew "nmap"
brew "nuclei"
brew "open-mpi"
brew "openjdk@11"
brew "papilo"
brew "parquet-cli"
brew "perl"
brew "pipx"
brew "pkg-config"
brew "pnpm"
brew "poetry"
brew "protobuf"
brew "pyenv"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "soplex"
brew "scip"
brew "sevenzip"
brew "shellcheck"
brew "snakeviz"
brew "swig"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "trivy"
brew "vim"
brew "wget"
brew "xq"
brew "databricks/tap/databricks"
brew "flyteorg/tap/flytectl"
brew "mongodb/brew/mongodb-community"
cask "1password-cli"
cask "adoptopenjdk"
cask "hashicorp-vagrant"
cask "pants"
cask "zap"
vscode "charliermarsh.ruff"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "kj.sqltools-driver-redshift"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "redhat.java"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
